pecostm32/FNIRSI-1013D-1014D-Hack/Software reverse engineering/1014D/CMSIS_SVD/GD32E230_plus_core_perihperals.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FPB</name>
         <description>Flash Patch and Breakpoint</description>
         <groupName>FPB</groupName>
         <prependToName>FPB_</prependToName>
         <baseAddress>0xE0002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>FP_CTRL</name>
               <description>Flash Patch Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Flash Patch global enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>FP_CTRL write-enable key</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NUM_CODE</name>
                     <description>Number of implemented code comparators bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NUM_LIT</name>
                     <description>Number of literal comparators</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NUM_CODE_1</name>
                     <description>Number of implemented code comparators bits [6:4]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>REV</name>
                     <description>Revision</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_REMAP</name>
               <description>Flash Patch Remap Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>REMAP</name>
                     <description>Remap address</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>RMPSPT</name>
                     <description>Remap supported</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>FP_COMP[%s]</name>
               <description>Flash Patch Comparator Register n</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BE</name>
                     <description>Breakpoint enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPADDR</name>
                     <description>Flash Patch address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Flash Patch enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>FP_COMP_BREAKPOINT_MODE[%s]</name>
               <description>Flash Patch Comparator Register n</description>
               <alternateRegister>FP_COMP[%s]</alternateRegister>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BE</name>
                     <description>Breakpoint enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BPADDR</name>
                     <description>Breakpoint address</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_LAR</name>
               <description>FPB Software Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Lock access control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>UNLOCK</name>
                           <description>Unlock key value</description>
                           <value>0xC5ACCE55</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_LSR</name>
               <description>FPB Software Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SLI</name>
                     <description>Software Lock implemented</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLK</name>
                     <description>Software Lock status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nTT</name>
                     <description>Not thirty-two bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_DEVARCH</name>
               <description>FPB Device Architecture Register</description>
               <addressOffset>0xFBC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x47701A03</resetValue>
               <fields>
                  <field>
                     <name>ARCHPART</name>
                     <description>Architecture Part</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ARCHVER</name>
                     <description>Architecture Version</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRESENT</name>
                     <description>DEVARCH Present</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARCHITECT</name>
                     <description>Architect</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_DEVTYPE</name>
               <description>FPB Device Type Register</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAJOR</name>
                     <description>Major type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUB</name>
                     <description>Sub-type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_PIDR4</name>
               <description>FP Peripheral Identification Register 4</description>
               <addressOffset>0xFD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_2</name>
                     <description>JEP106 continuation code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>4KB count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_PIDR5</name>
               <description>FP Peripheral Identification Register 5</description>
               <addressOffset>0xFD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>FP_PIDR6</name>
               <description>FP Peripheral Identification Register 6</description>
               <addressOffset>0xFD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>FP_PIDR7</name>
               <description>FP Peripheral Identification Register 7</description>
               <addressOffset>0xFDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>FP_PIDR0</name>
               <description>FP Peripheral Identification Register 0</description>
               <addressOffset>0xFE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_0</name>
                     <description>Part number bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_PIDR1</name>
               <description>FP Peripheral Identification Register 1</description>
               <addressOffset>0xFE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_1</name>
                     <description>Part number bits[11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DES_0</name>
                     <description>JEP106 identification code bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_PIDR2</name>
               <description>FP Peripheral Identification Register 2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_1</name>
                     <description>JEP106 identification code bits[6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>JEDEC assignee value is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Component revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_PIDR3</name>
               <description>FP Peripheral Identification Register 3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Customer Modified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>RevAnd</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_CIDR0</name>
               <description>FP Component Identification Register 0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_0</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_CIDR1</name>
               <description>FP Component Identification Register 1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_1</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLASS</name>
                     <description>CoreSight component class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_CIDR2</name>
               <description>FP Component Identification Register 2</description>
               <addressOffset>0xFF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_2</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FP_CIDR3</name>
               <description>FP Component Identification Register 3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_3</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
