pecostm32/FNIRSI-1013D-1014D-Hack/Software reverse engineering/1014D/CMSIS_SVD/GD32E230_plus_core_perihperals.svd
            <register>
               <name>SHPR3</name>
               <description>System Handler Priority Register 3</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRI_12</name>
                     <description>Priority of system handler 12, DebugMonitor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_14</name>
                     <description>Priority of system handler 14, PendSV</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_15</name>
                     <description>Priority of system handler 15, SysTick</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHCSR</name>
               <description>System Handler Control and State Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HARDFAULTACT</name>
                     <description>HardFault exception active state</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMIACT</name>
                     <description>NMI exception active state</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVCALLACT</name>
                     <description>SVCall exception active state</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSVACT</name>
                     <description>PendSV exception active state</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSTICKACT</name>
                     <description>SysTick exception active state</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVCALLPENDED</name>
                     <description>SVCall exception pended state</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HARDFAULTPENDED</name>
                     <description>HardFault exception pended state</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSR</name>
               <description>Debug Fault Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HALTED</name>
                     <description>Halt or step event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKPT</name>
                     <description>Breakpoint event</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DWTTRAP</name>
                     <description>Watchpoint event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VCATCH</name>
                     <description>Vector Catch event</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTERNAL</name>
                     <description>External event</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFSR</name>
               <description>Auxiliary Fault Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CLIDR</name>
               <description>Cache Level ID Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>Ctype1</name>
                     <description>Cache type at level 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype1Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype2</name>
                     <description>Cache type at level 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype2Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype3</name>
                     <description>Cache type at level 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype3Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype4</name>
                     <description>Cache type at level 4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype4Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype5</name>
                     <description>Cache type at level 5</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype5Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype6</name>
                     <description>Cache type at level 6</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype6Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Ctype7</name>
                     <description>Cache type at level 7</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>Ctype7Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IC</name>
                           <description>Instruction cache only</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DC</name>
                           <description>Data cache only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEPARATE</name>
                           <description>Separate instruction and data caches</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNIFIED</name>
                           <description>Unified cache</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LoUIS</name>
                     <description>Level of Unification Inner Shareable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LoC</name>
                     <description>Level of Coherence</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LoUU</name>
                     <description>Level of Unification Uniprocessor</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ICB</name>
                     <description>Inner cache boundary</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ICBSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Not disclosed in this mechanism</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>L1</name>
                           <description>L1 cache is the highest inner level</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>L2</name>
                           <description>L2 cache is the highest inner level</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>L3</name>
                           <description>L3 cache is the highest inner level</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTR</name>
               <description>Cache Type Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IminLine</name>
                     <description>Instruction cache minimum line length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DminLine</name>
                     <description>Data cache minimum line length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ERG</name>
                     <description>Exclusives Reservation Granule</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWG</name>
                     <description>Cache Write-back Granule</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>Format</name>
                     <description>Cache Type Register format</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FormatSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No cache type information provided</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Cache type information is provided</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCSIDR</name>
               <description>Current Cache Size ID register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LineSize</name>
                     <description>log2(number of words per line) - 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>Associativity</name>
                     <description>Associativity - 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>NumSets</name>
                     <description>Number of sets - 1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>WA</name>
                     <description>Write-Allocate</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RA</name>
                     <description>Read-Allocate</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WB</name>
                     <description>Write-Back</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WT</name>
                     <description>Write-Through</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
